Lines must be in closed loops. The highlighted lines are open on one end.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OpenLoopPath3d { get; }
  Visual Basic
Public Shared ReadOnly Property OpenLoopPath3d As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OpenLoopPath3d {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace